#!/usr/bin/env python
# coding: utf8
from time import sleep
Test = None

from decimal import Decimal
import datetime
#from gluon import *
import urllib
import httplib
import json

import db_common

def gas(db):
    subsel = [

#// СЕВЕРО-ЗАПАДНЫЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
[1,22738,"ЗАО \"Газпром межрегионгаз Санкт-Петербург\" (г. Санкт-Петербург)"],
[1,22739,"ЗАО \"Газпром межрегионгаз Санкт-Петербург\" (Ленинградская область)"],
[1,22740,"ЗАО \"Газпром межрегионгаз Санкт-Петербург\" (Республика Карелия)"],
[1,22741,"ЗАО \"Газпром межрегионгаз Санкт-Петербург\" (Калининградская область)"],
[1,23730,"ООО \"Газпром межрегионгаз Вологда\""],
[1,23728,"ООО \"Газпром межрегионгаз Великий Новгород\""],
[1,22501,"ООО \"Газпром межрегионгаз Ухта\""],
[1,22743,"ООО \"Газпром межрегионгаз Псков\""],

#// ЦЕНТРАЛЬНЫЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
#//[2,,"ООО \"Белрегионгаз\""],
[2,22742,"ООО \"Газпром межрегионгаз Брянск\""],
[2,23729,"ООО \"Газпром межрегионгаз Владимир\""],
[2,22605,"ООО \"Газпром межрегионгаз Воронеж\""],
[2,26604,"ООО \"Газпром межрегионгаз Иваново\""],
[2,23731,"ООО \"Газпром межрегионгаз Калуга\""],
#//[2,25460,"ООО \"Газпром межрегионгаз Кострома\""],
[2,22744,"ООО \"Газпром межрегионгаз Курск\""],
[2,23732,"ООО \"Газпром межрегионгаз Липецк\""],
[2,22606,"ООО \"Газпром межрегионгаз Москва\""],
[2,22745,"ООО \"Газпром межрегионгаз Орел\""],
[2,22754,"ООО \"Газпром межрегионгаз Рязань\""],
[2,23733,"ООО \"Газпром межрегионгаз Смоленск\""],
[2,25461,"ООО \"Газпром межрегионгаз Тамбов\""],
[2,25462,"ООО \"Газпром межрегионгаз Тверь\""],
[2,28464,"ООО \"Газпром межрегионгаз Тула\""],
[2,22753,"ООО \"Газпром межрегионгаз Ярославль\""],

#// ПРИВОЛЖСКИЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
#//[3,,"ООО \"Газпром межрегионгаз Уфа\""],
[3,22746,"ООО \"Газпром межрегионгаз Киров\""],
[3,22607,"ООО \"Газпром межрегионгаз Йошкар-Ола\""],
[3,26603,"ООО \"Газпром межрегионгаз Саранск\""],
[3,22608,"ОАО \"Газпром межрегионгаз Нижний Новгород\""],
[3,22747,"ООО \"Газпром межрегионгаз Оренбург\""],
[3,25463,"ООО \"Газпром межрегионгаз Пенза\""],
[3,22609,"ООО \"Газпром межрегионгаз Пермь\""],
[3,22748,"ООО \"Газпром межрегионгаз Самара\" (г. Сызрань)"],
[3,22749,"ООО \"Газпром межрегионгаз Самара\" (г. Жигулевск)"],
[3,23734,"ООО \"Газпром межрегионгаз Саратов\""],
#//[3,,"ЗАО \"Газпром межрегионгаз Казань\""],
[3,22610,"ООО \"Газпром межрегионгаз Ижевск\""],
[3,32057,"ООО \"Газпром межрегионгаз Ульяновск\""],
[3,26605,"ООО \"Газпром межрегионгаз Чебоксары\""],

#// ЮЖНЫЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
[4,22614,"ООО \"Газпром межрегионгаз Майкоп\""],
[4,23735,"ЗАО \"Газпром межрегионгаз Астрахань\""],
[4,22750,"ООО \"Газпром межрегионгаз Волгоград\""],
#//[4,,"ООО \"Газпром межрегионгаз Ставрополь\""],
[4,25464,"ООО \"Газпром межрегионгаз Краснодар\""],
[4,25465,"ООО \"Газпром межрегионгаз Ростов-на-Дону\""],

#// СЕВЕРО-КАВКАЗСКИЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
[5,22611,"ООО \"Газпром межрегионгаз Пятигорск\""],
[5,25466,"ООО \"Газпром межрегионгаз Ставрополь\""],
#//[5,,"ЗАО \"Газпром межрегионгаз Грозный\""],

#// УРАЛЬСКИЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
[6,31458,"ООО \"Газпром межрегионгаз Курган\""],
[6,22612,"ЗАО \"Газпром межрегионгаз Север\""],
#//[6,,"ООО \"Газпром межрегионгаз Челябинск\""],

#// СИБИРСКИЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
#//[7,,"ООО \"Газпром межрегионгаз Новосибирск\""],
[7,22751,"ООО \"Газпром межрегионгаз Новосибирск\" (Алтайский край)"],
[7,22752,"ООО \"Газпром межрегионгаз Новосибирск\" (Новосибирская область)"],
[7,22613,"ООО \"Газпром межрегионгаз Кемерово\""],
[7,22755,"ЗАО \"Газпром межрегионгаз Омск\""],

#// ДАЛЬНЕВОСТОЧНЫЙ ФЕДЕРАЛЬНЫЙ ОКРУГ
[8,35023,"ООО \"Газпром межрегионгаз Новосибирск\" (Сахалинская область)"]
]
